app/Controllers/CAuth.php

INSERT INTO `user` (`username`, `email`, `password`, `role`) VALUES ('Gifarly', 'gifarlydals06@gmail.com', '$2y$10$e8MFNqLSDB6DXWpDLCYmWugtOIMmodhJDzSRxwhZcRk2Vl7dfBc2G', 'user')
---
            'role'     => 'user'
        ];

        $user->insert($data);

SELECT *
FROM `user`
WHERE `email` = 'admin@email.com'
 LIMIT 1
---
    public function ceklogin()
    {
        $user = new Muser();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $cek = $user->where(['email' => $email])->first();