app/Controllers/CPlanMakan.php

    public function index()
    {
        $idUser  = session()->idUser;

        // ✅ Tanggal dinamis (bisa pindah-pindah)
        $tanggal = $this->request->getGet('tanggal') ?? date('Y-m-d');

        $planModel   = new MPlanMakan();
        $detailModel = new MDetailPM();

        // ✅ Ambil plan berdasarkan tanggal & user
        $plan = $planModel->getPlanByDate($idUser, $tanggal);

        // ✅ Jika belum ada → buat plan baru otomatis
        if (!$plan) {
            $planModel->insert([
                'idUser'  => $idUser,
                'tanggal' => $tanggal,
                'type'    => 'harian'
            ]);
---
INSERT INTO `plan_makan` (`idUser`, `tanggal`, `type`) VALUES ('7', '2025-10-30', 'harian')

    public function tambah()
    {
        $detailModel = new MDetailPM();
        $planModel   = new MPlanMakan();

        $idPlan = $this->request->getPost('idPlanMakan');

        $data = [
            'idPlanMakan' => $idPlan,
            'makanan'     => $this->request->getPost('makanan'),
            'kategori'    => $this->request->getPost('kategori'),
            'porsi'       => $this->request->getPost('porsi'),
            'waktu'       => $this->request->getPost('waktu'),
            'kalori'      => $this->request->getPost('kalori')
        ];

        $detailModel->insert($data);

        // ✅ Update total
        $all = $detailModel->where('idPlanMakan', $idPlan)->findAll();
        $planModel->update($idPlan, [
            'totalKalori' => array_sum(array_column($all, 'kalori')),
            'totalPorsi'  => array_sum(array_column($all, 'porsi'))
        ]);

        return redirect()->to('planmakan?tanggal=' . $planModel->find($idPlan)['tanggal']);
---
SELECT *
FROM `detail_plan_makan`
WHERE `idPlanMakan` = '3'
UPDATE `plan_makan` SET `totalKalori` = 263, `totalPorsi` = 1
WHERE `plan_makan`.`idPlanMakan` IN ('3')
SELECT *
FROM `plan_makan`
WHERE `plan_makan`.`idPlanMakan` = '3'