app/Controllers/CUserManage.php

SELECT *
FROM `user`
WHERE `email` = 'gifarlydals@gmail.com'
AND `idUser` != '8'
 LIMIT 1
UPDATE `user` SET `username` = 'Gifarly1', `email` = 'gifarlydals@gmail.com', `password` = '$2y$10$4vhAp44vjWWYnwFmOYI4bO6U4slqVnNOqPUDiRPFu4NNqTXin2hXi', `role` = 'user'
WHERE `user`.`idUser` IN ('8')
---
    public function editData($idUser)
    {
        $user = new Muser();

        $username = $this->request->getPost('username');
        $email    = $this->request->getPost('email');
        $role     = $this->request->getPost('role');
        $password = $this->request->getPost('password');

        $existingUser = $user->where('email', $email)
                            ->where('idUser !=', $idUser)
                            ->first();

        if ($existingUser) {
            session()->setFlashdata('error', 'Email sudah digunakan oleh user lain!');
            return redirect()->back()->withInput();
        }

        $data = [
            'username' => $username,
            'email'    => $email,
            'role'     => $role
        ];

        if (!empty($password)) {
            $data['password'] = password_hash($password, PASSWORD_BCRYPT);
        }

        $user->update($idUser, $data);