app/Models/MDetailPM.php

SELECT *
FROM `detail_plan_makan`
WHERE `idPlanMakan` = '3'
AND `kategori` = 'sarapan'
---
    public function getByKategori($idPlanMakan, $kategori)
    {
        return $this->where('idPlanMakan', $idPlanMakan)
                    ->where('kategori', $kategori)
                    ->findAll();