app/Models/MPlanMakan.php

SELECT *
FROM `plan_makan`
WHERE `idUser` = '7'
AND `tanggal` = '2025-10-30'
 LIMIT 1
---
    public function getPlanByDate($idUser, $tanggal)
    {
        return $this->where('idUser', $idUser)
                    ->where('tanggal', $tanggal)
                    ->first();