app/Models/Muser.php

SELECT *
FROM `User`
ORDER BY `idUser` ASC
---
    public function Tampil_data()
    {
        return $this->db->table('user')
            ->orderBy('idUser', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `user`
WHERE `idUser` = '7'
 LIMIT 1
---
    public function getById($idUser)
    {
        return $this->where('idUser', $idUser)->first();